//
//  Festival.swift
//  LenoCalendar
//
//  Created by Angus on 2023/1/6.
//

import Foundation

struct Festival {
    static let festivals: [String: String] = [
        "2022-11-22": "小雪",
        "2022-12-7": "大雪",
        "2022-12-22": "冬至",
        "2023-1-1": "元旦",
        "2023-1-5": "小寒",
        "2023-1-20": "大寒",
        "2023-2-4": "立春",
        "2023-2-14": "情人节",
        "2023-2-19": "雨水",
        "2023-3-6": "惊蛰",
        "2023-3-8": "妇女节",
        "2023-3-12": "植树节",
        "2023-3-21": "春分",
        "2023-4-5": "清明",
        "2023-4-20": "谷雨",
        "2023-5-1": "劳动节",
        "2023-5-4": "青年节",
        "2023-5-6": "立夏",
        "2023-5-21": "小满",
        "2023-6-1": "儿童节",
        "2023-6-6": "芒种",
        "2023-6-21": "夏至",
        "2023-7-1": "建党节",
        "2023-7-7": "小暑",
        "2023-7-23": "大暑",
        "2023-8-1": "建军节",
        "2023-8-8": "立秋",
        "2023-8-23": "处暑",
        "2023-9-8": "白露",
        "2023-9-23": "秋分",
        "2023-10-1": "国庆",
        "2023-10-8": "寒露",
        "2023-10-24": "霜降",
        "2023-11-8": "立冬",
        "2023-11-22": "小雪",
        "2023-12-7": "大雪",
        "2023-12-22": "冬至",
        "2023-12-25": "圣诞节",
        "2024-1-6": "小寒",
        "2024-1-20": "大寒"
    ]
    
    static func getFistival(date: Date) -> String? {
        let key = DateFormatter(dateFormatter: "YYYY-M-d", calendar: Calendar(identifier: .gregorian)).string(from: date)
        
        if let festival = festivals[key] {
            return festival
        }
        
        return nil
    }
}
